Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t
Serialization structure for UserPropertyItem.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.USERPROPERTY_VALUEOPTIONS_SIZE
Max count of options

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.Name
The name of the user property

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.Label
The label of the user property

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.LabelTranslated
The translated label of the user property

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.Type
The type of the user property.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.FieldType
The field type of the user property.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.Level
The level of the user property.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.AffectsNumbering
AffectsNumbering.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.Unique
Unique.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.Visibility
Visibility.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.IntDefaultValue
Integer default value.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.DoubleDefaultValue
Double default value.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.StringDefaultValue
String default value.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.nOptionValues
Count of option values.

Tekla.Structures.CatalogInternal.dotcatUserPropertyItem_t.aOptions
Option values.